#### Terraform Plan

<details><summary>Show Plan</summary>

```
aws_cloudwatch_log_group.InitializeTable_Function_CloudwatchLogGroup_E746307D: Refreshing state... [id=/aws/lambda/Function-c8e7055b]
aws_s3_object.VotingAppStore_EntiresTable_Field_Handler_S3Object_271164A5: Refreshing state... [id=asset.c82491a2ec5b7a164e717e9480c7bd986febfef2e2.df8e33810800861beb66401181e3916c.zip]
aws_cloudwatch_log_group.VotingAppStore_EntiresTable_Field_Handler_CloudwatchLogGroup_D15974AF: Refreshing state... [id=/aws/lambda/Handler-c82491a2]
aws_cloudfront_origin_access_control.Website_CloudfrontOac_756836A4: Refreshing state... [id=E1QPCRC4S73963]
aws_iam_role.VotingAppStore_EntiresTable_Field_Handler_IamRole_3843DEBE: Refreshing state... [id=terraform-20240413014120659100000002]
aws_lambda_function.VotingAppStore_EntiresTable_Field_Handler_B81E2714: Refreshing state... [id=Handler-c82491a2]
aws_iam_role_policy.VotingAppStore_EntiresTable_Field_Handler_IamRolePolicy_49C725DB: Refreshing state... [id=terraform-20240413014120659100000002:terraform-20240413014120898200000003]
aws_iam_role_policy_attachment.VotingAppStore_EntiresTable_Field_Handler_IamRolePolicyAttachment_3A12DE75: Refreshing state... [id=terraform-20240413014120659100000002-20240413014120962400000004]
aws_dynamodb_table.VotingAppStore_EntiresTable_Table_tfaws_DynamodbTable_677BFC89: Refreshing state... [id=VotingAppStore-EntiresTable-Table_tfaws-4ad4d368]
aws_cloudwatch_log_group.VotingAppApi_post_selectWinner0_CloudwatchLogGroup_FF958712: Refreshing state... [id=/aws/lambda/post_selectWinner0-c8d65bd1]
aws_iam_role.VotingAppApi_get_leaderboard0_IamRole_DE30BD64: Refreshing state... [id=terraform-20240208163203724700000003]
aws_s3_bucket.Website_WebsiteBucket_3C0321F0: Refreshing state... [id=website-c80d509a-20240413014120522100000001]
aws_cloudwatch_log_group.VotingAppApi_post_requestChoices0_CloudwatchLogGroup_679E4CF2: Refreshing state... [id=/aws/lambda/post_requestChoices0-c8820ba5]
aws_iam_role.VotingAppApi_post_selectWinner0_IamRole_3824DF8A: Refreshing state... [id=terraform-20240208163203720100000002]
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
aws_iam_role.VotingAppApi_post_requestChoices0_IamRole_22F6E9E7: Refreshing state... [id=terraform-20240208163203806300000004]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
data.aws_caller_identity.account: Reading...
data.aws_region.Region: Reading...
data.aws_region.Region: Read complete after 0s [id=us-east-1]
aws_cloudwatch_log_group.VotingAppApi_get_leaderboard0_CloudwatchLogGroup_80A5B81E: Refreshing state... [id=/aws/lambda/get_leaderboard0-c8bf3988]
data.aws_caller_identity.account: Read complete after 0s [id=223316951128]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=f9yi5t9zj2]
aws_iam_role_policy_attachment.VotingAppApi_get_leaderboard0_IamRolePolicyAttachment_7BB9531C: Refreshing state... [id=terraform-20240208163203724700000003-20240208163204000500000005]
aws_iam_role_policy.VotingAppApi_get_leaderboard0_IamRolePolicy_F06B1AF0: Refreshing state... [id=terraform-20240208163203724700000003:terraform-20240208163217070500000008]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_iam_role_policy_attachment.VotingAppApi_post_selectWinner0_IamRolePolicyAttachment_A11AE727: Refreshing state... [id=terraform-20240208163203720100000002-20240208163204033500000006]
aws_iam_role_policy.VotingAppApi_post_selectWinner0_IamRolePolicy_538B4B66: Refreshing state... [id=terraform-20240208163203720100000002:terraform-20240208163217106000000009]
aws_iam_role_policy_attachment.VotingAppApi_post_requestChoices0_IamRolePolicyAttachment_E91C632D: Refreshing state... [id=terraform-20240208163203806300000004-20240208163204103600000007]
aws_iam_role_policy.VotingAppApi_post_requestChoices0_IamRolePolicy_926B955D: Refreshing state... [id=terraform-20240208163203806300000004:terraform-2024020816321710710000000a]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=6fvs1g]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-f9yi5t9zj2-prod]
aws_s3_object.VotingAppApi_post_requestChoices0_S3Object_E5911DA4: Refreshing state... [id=asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.c17c81857badf45da27670f79b36cc93.zip]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.39021b0bb853d8a07a74fa235dba9511.zip]
aws_s3_object.VotingAppApi_post_selectWinner0_S3Object_3DCD8E80: Refreshing state... [id=asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.dadf8a10e088212e5f582182b2b03305.zip]
aws_s3_object.VotingAppApi_get_leaderboard0_S3Object_D4AF4AC9: Refreshing state... [id=asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.22503b883a1ab20226cfd6c66d80ebf3.zip]
aws_s3_object.Website_File--static--js--78728cb0dcdchunkjsmap_A7876A97: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js.map]
aws_s3_object.Website_File--static--js--78728cb0dcdchunkjs_4D3C7C28: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js]
aws_s3_object.Website_File--logo192png_E4AF1BF9: Refreshing state... [id=/logo192.png]
aws_s3_object.Website_File-configjson_1F1498B9: Refreshing state... [id=config.json]
aws_s3_object.Website_File--static--css--main10aaf8f6css_BBD24851: Refreshing state... [id=/static/css/main.10aaf8f6.css]
aws_cloudfront_distribution.Website_Distribution_5E840E42: Refreshing state... [id=E3ORJW9C8IES5W]
aws_s3_object.Website_File--static--js--main5da68f89js_47D438C4: Refreshing state... [id=/static/js/main.5da68f89.js]
aws_s3_object.Website_File--static--js--main5da68f89jsLICENSEtxt_19A2F8B1: Refreshing state... [id=/static/js/main.5da68f89.js.LICENSE.txt]
aws_s3_object.Website_File--static--css--main10aaf8f6cssmap_604FA42B: Refreshing state... [id=/static/css/main.10aaf8f6.css.map]
aws_s3_bucket_website_configuration.Website_BucketWebsiteConfiguration_58F891B4: Refreshing state... [id=website-c80d509a-20240413014120522100000001]
aws_s3_object.Website_File--robotstxt_DFDBAC57: Refreshing state... [id=/robots.txt]
aws_s3_object.Website_File--static--js--main5da68f89jsmap_3269D0BF: Refreshing state... [id=/static/js/main.5da68f89.js.map]
aws_s3_object.Website_File--asset-manifestjson_629F18DB: Refreshing state... [id=/asset-manifest.json]
aws_s3_object.Website_File--indexhtml_864F8C36: Refreshing state... [id=/index.html]
aws_s3_object.Website_File--faviconico_F8742748: Refreshing state... [id=/favicon.ico]
aws_s3_object.Website_File--manifestjson_CB9AB1A6: Refreshing state... [id=/manifest.json]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]
aws_lambda_function.VotingAppApi_post_selectWinner0_B484847F: Refreshing state... [id=post_selectWinner0-c8d65bd1]
data.aws_iam_policy_document.Website_AllowDistributionReadOnly_24CFF6C0: Reading...
data.aws_iam_policy_document.Website_AllowDistributionReadOnly_24CFF6C0: Read complete after 0s [id=2760666405]
aws_lambda_function.VotingAppApi_post_requestChoices0_78C94EF5: Refreshing state... [id=post_requestChoices0-c8820ba5]
aws_s3_bucket_policy.Website_DistributionS3BucketPolicy_09AE0BCA: Refreshing state... [id=website-c80d509a-20240413014120522100000001]
aws_lambda_function.VotingAppApi_get_leaderboard0_6A571716: Refreshing state... [id=get_leaderboard0-c8bf3988]
aws_lambda_permission.VotingAppApi_api_permission-GET-5969f3af_56B4A504: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-5969f3af]
aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-57590acc]
aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-53dc1f64]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_cloudwatch_log_group.VotingAppStore_EntiresTable_Field_Handler_CloudwatchLogGroup_D15974AF will be destroyed
  # (because aws_cloudwatch_log_group.VotingAppStore_EntiresTable_Field_Handler_CloudwatchLogGroup_D15974AF is not in configuration)
  - resource "aws_cloudwatch_log_group" "VotingAppStore_EntiresTable_Field_Handler_CloudwatchLogGroup_D15974AF" {
      - arn               = "arn:aws:logs:us-east-1:223316951128:log-group:/aws/lambda/Handler-c82491a2" -> null
      - id                = "/aws/lambda/Handler-c82491a2" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/Handler-c82491a2" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_cloudwatch_log_group.VotingAppStore_EntriesTable_TableName_Handler_CloudwatchLogGroup_FDB09B84 will be created
  + resource "aws_cloudwatch_log_group" "VotingAppStore_EntriesTable_TableName_Handler_CloudwatchLogGroup_FDB09B84" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Handler-c80747e1"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_dynamodb_table.VotingAppStore_EntiresTable_Table_tfaws_DynamodbTable_677BFC89 will be destroyed
  # (because aws_dynamodb_table.VotingAppStore_EntiresTable_Table_tfaws_DynamodbTable_677BFC89 is not in configuration)
  - resource "aws_dynamodb_table" "VotingAppStore_EntiresTable_Table_tfaws_DynamodbTable_677BFC89" {
      - arn                         = "arn:aws:dynamodb:us-east-1:223316951128:table/VotingAppStore-EntiresTable-Table_tfaws-4ad4d368" -> null
      - billing_mode                = "PAY_PER_REQUEST" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "Name" -> null
      - id                          = "VotingAppStore-EntiresTable-Table_tfaws-4ad4d368" -> null
      - name                        = "VotingAppStore-EntiresTable-Table_tfaws-4ad4d368" -> null
      - read_capacity               = 0 -> null
      - stream_arn                  = "arn:aws:dynamodb:us-east-1:223316951128:table/VotingAppStore-EntiresTable-Table_tfaws-4ad4d368/stream/2024-04-13T01:41:20.697" -> null
      - stream_enabled              = true -> null
      - stream_label                = "2024-04-13T01:41:20.697" -> null
      - stream_view_type            = "NEW_AND_OLD_IMAGES" -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - write_capacity              = 0 -> null

      - attribute {
          - name = "Name" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # aws_dynamodb_table.VotingAppStore_EntriesTable_Table_tfaws_DynamodbTable_0FB96AAD will be created
  + resource "aws_dynamodb_table" "VotingAppStore_EntriesTable_Table_tfaws_DynamodbTable_0FB96AAD" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Name"
      + id               = (known after apply)
      + name             = "VotingAppStore-EntriesTable-Table_tfaws-94db165b"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Name"
          + type = "S"
        }
    }

  # aws_iam_role.VotingAppStore_EntiresTable_Field_Handler_IamRole_3843DEBE will be destroyed
  # (because aws_iam_role.VotingAppStore_EntiresTable_Field_Handler_IamRole_3843DEBE is not in configuration)
  - resource "aws_iam_role" "VotingAppStore_EntiresTable_Field_Handler_IamRole_3843DEBE" {
      - arn                   = "arn:aws:iam::223316951128:role/terraform-20240413014120659100000002" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-04-13T01:41:20Z" -> null
      - force_detach_policies = false -> null
      - id                    = "terraform-20240413014120659100000002" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "terraform-20240413014120659100000002" -> null
      - name_prefix           = "terraform-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATH7V2IBMHDXEMB2MI" -> null

      - inline_policy {
          - name   = "terraform-20240413014120898200000003" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "none:null"
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.VotingAppStore_EntriesTable_TableName_Handler_IamRole_61B675BC will be created
  + resource "aws_iam_role" "VotingAppStore_EntriesTable_TableName_Handler_IamRole_61B675BC" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519 will be updated in-place
  ~ resource "aws_iam_role_policy" "InitializeTable_Function_IamRolePolicy_2AD89519" {
        id          = "terraform-20230727202411672600000001:terraform-20230727202424567600000008"
        name        = "terraform-20230727202424567600000008"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:GetItem",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/VotingAppStore-EntiresTable-Table_tfaws-4ad4d368",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.VotingAppApi_get_leaderboard0_IamRolePolicy_F06B1AF0 will be updated in-place
  ~ resource "aws_iam_role_policy" "VotingAppApi_get_leaderboard0_IamRolePolicy_F06B1AF0" {
        id          = "terraform-20240208163203724700000003:terraform-20240208163217070500000008"
        name        = "terraform-20240208163217070500000008"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/VotingAppStore-EntiresTable-Table_tfaws-4ad4d368",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.VotingAppApi_post_requestChoices0_IamRolePolicy_926B955D will be updated in-place
  ~ resource "aws_iam_role_policy" "VotingAppApi_post_requestChoices0_IamRolePolicy_926B955D" {
        id          = "terraform-20240208163203806300000004:terraform-2024020816321710710000000a"
        name        = "terraform-2024020816321710710000000a"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/VotingAppStore-EntiresTable-Table_tfaws-4ad4d368",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.VotingAppApi_post_selectWinner0_IamRolePolicy_538B4B66 will be updated in-place
  ~ resource "aws_iam_role_policy" "VotingAppApi_post_selectWinner0_IamRolePolicy_538B4B66" {
        id          = "terraform-20240208163203720100000002:terraform-20240208163217106000000009"
        name        = "terraform-20240208163217106000000009"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:GetItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/VotingAppStore-EntiresTable-Table_tfaws-4ad4d368",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.VotingAppStore_EntiresTable_Field_Handler_IamRolePolicy_49C725DB will be destroyed
  # (because aws_iam_role_policy.VotingAppStore_EntiresTable_Field_Handler_IamRolePolicy_49C725DB is not in configuration)
  - resource "aws_iam_role_policy" "VotingAppStore_EntiresTable_Field_Handler_IamRolePolicy_49C725DB" {
      - id          = "terraform-20240413014120659100000002:terraform-20240413014120898200000003" -> null
      - name        = "terraform-20240413014120898200000003" -> null
      - name_prefix = "terraform-" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "none:null"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "terraform-20240413014120659100000002" -> null
    }

  # aws_iam_role_policy.VotingAppStore_EntriesTable_TableName_Handler_IamRolePolicy_C8858CFD will be created
  + resource "aws_iam_role_policy" "VotingAppStore_EntriesTable_TableName_Handler_IamRolePolicy_C8858CFD" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "none:null"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.VotingAppStore_EntiresTable_Field_Handler_IamRolePolicyAttachment_3A12DE75 will be destroyed
  # (because aws_iam_role_policy_attachment.VotingAppStore_EntiresTable_Field_Handler_IamRolePolicyAttachment_3A12DE75 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "VotingAppStore_EntiresTable_Field_Handler_IamRolePolicyAttachment_3A12DE75" {
      - id         = "terraform-20240413014120659100000002-20240413014120962400000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "terraform-20240413014120659100000002" -> null
    }

  # aws_iam_role_policy_attachment.VotingAppStore_EntriesTable_TableName_Handler_IamRolePolicyAttachment_AA0ED7E5 will be created
  + resource "aws_iam_role_policy_attachment" "VotingAppStore_EntriesTable_TableName_Handler_IamRolePolicyAttachment_AA0ED7E5" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2024-05-06T18:37:53.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:33" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:33/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.39021b0bb853d8a07a74fa235dba9511.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.6ed69998cc74cd2f3aa422a4c517cede.zip"
        tags                           = {}
      ~ version                        = "33" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"VotingAppStore-EntiresTable-Table_tfaws-4ad4d368\"" -> "\"VotingAppStore-EntriesTable-Table_tfaws-94db165b\""
                # (3 unchanged elements hidden)
            }
        }

      ~ logging_config {
          ~ log_format = "Text" -> "JSON"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_get_leaderboard0_6A571716 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_get_leaderboard0_6A571716" {
        id                             = "get_leaderboard0-c8bf3988"
      ~ last_modified                  = "2024-05-06T18:37:53.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard0-c8bf3988:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:get_leaderboard0-c8bf3988:11/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.22503b883a1ab20226cfd6c66d80ebf3.zip" -> "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.b352c73d160993b87d2a5bf36db214a8.zip"
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"VotingAppStore-EntiresTable-Table_tfaws-4ad4d368\"" -> "\"VotingAppStore-EntriesTable-Table_tfaws-94db165b\""
                # (3 unchanged elements hidden)
            }
        }

      ~ logging_config {
          ~ log_format = "Text" -> "JSON"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_post_requestChoices0_78C94EF5 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_post_requestChoices0_78C94EF5" {
        id                             = "post_requestChoices0-c8820ba5"
      ~ last_modified                  = "2024-05-06T18:37:53.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices0-c8820ba5:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_requestChoices0-c8820ba5:11/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.c17c81857badf45da27670f79b36cc93.zip" -> "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.7e846ca4150639707d82363ccb6f2c76.zip"
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"VotingAppStore-EntiresTable-Table_tfaws-4ad4d368\"" -> "\"VotingAppStore-EntriesTable-Table_tfaws-94db165b\""
                # (3 unchanged elements hidden)
            }
        }

      ~ logging_config {
          ~ log_format = "Text" -> "JSON"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_post_selectWinner0_B484847F will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_post_selectWinner0_B484847F" {
        id                             = "post_selectWinner0-c8d65bd1"
      ~ last_modified                  = "2024-05-06T18:37:53.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner0-c8d65bd1:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:post_selectWinner0-c8d65bd1:11/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.dadf8a10e088212e5f582182b2b03305.zip" -> "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.8aa1aa495b45d77f0663ef71fe8fa598.zip"
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"VotingAppStore-EntiresTable-Table_tfaws-4ad4d368\"" -> "\"VotingAppStore-EntriesTable-Table_tfaws-94db165b\""
                # (3 unchanged elements hidden)
            }
        }

      ~ logging_config {
          ~ log_format = "Text" -> "JSON"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppStore_EntiresTable_Field_Handler_B81E2714 will be destroyed
  # (because aws_lambda_function.VotingAppStore_EntiresTable_Field_Handler_B81E2714 is not in configuration)
  - resource "aws_lambda_function" "VotingAppStore_EntiresTable_Field_Handler_B81E2714" {
      - architectures                  = [
          - "arm64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:223316951128:function:Handler-c82491a2" -> null
      - code_sha256                    = "Vu+pppDHmW1BpUbMZWAS3mRkVfCMAdNUrtfY94d29KQ=" -> null
      - function_name                  = "Handler-c82491a2" -> null
      - handler                        = "index.handler" -> null
      - id                             = "Handler-c82491a2" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Handler-c82491a2/invocations" -> null
      - last_modified                  = "2024-05-06T18:37:53.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 1024 -> null
      - package_type                   = "Zip" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Handler-c82491a2:2" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Handler-c82491a2:2/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::223316951128:role/terraform-20240413014120659100000002" -> null
      - runtime                        = "nodejs20.x" -> null
      - s3_bucket                      = "code-c84a50b1-20230727202411678600000003" -> null
      - s3_key                         = "asset.c82491a2ec5b7a164e717e9480c7bd986febfef2e2.df8e33810800861beb66401181e3916c.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "Vu+pppDHmW1BpUbMZWAS3mRkVfCMAdNUrtfY94d29KQ=" -> null
      - source_code_size               = 5570 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 60 -> null
      - version                        = "2" -> null

      - environment {
          - variables = {
              - "NODE_OPTIONS"               = "--enable-source-maps"
              - "WING_FUNCTION_NAME"         = "Handler-c82491a2"
              - "WING_TARGET"                = "tf-aws"
              - "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"VotingAppStore-EntiresTable-Table_tfaws-4ad4d368\""
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format = "Text" -> null
          - log_group  = "/aws/lambda/Handler-c82491a2" -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.VotingAppStore_EntriesTable_TableName_Handler_3B9356C0 will be created
  + resource "aws_lambda_function" "VotingAppStore_EntriesTable_TableName_Handler_3B9356C0" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "Handler-c80747e1"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + s3_bucket                      = "code-c84a50b1-20230727202411678600000003"
      + s3_key                         = "asset.c80747e13deed42678216aea62b0d56baafb6fa1f9.5f29b59afcc466b2ad20f5f7e3a957a3.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "NODE_OPTIONS"               = "--enable-source-maps"
              + "WING_FUNCTION_NAME"         = "Handler-c80747e1"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_0" = "\"VotingAppStore-EntriesTable-Table_tfaws-94db165b\""
            }
        }

      + logging_config {
          + log_format = "JSON"
          + log_group  = (known after apply)
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      + acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::code-c84a50b1-20230727202411678600000003/asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.39021b0bb853d8a07a74fa235dba9511.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "c42f3f5dd95af01b142271de2c6081f5" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.39021b0bb853d8a07a74fa235dba9511.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.39021b0bb853d8a07a74fa235dba9511.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.6ed69998cc74cd2f3aa422a4c517cede.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/ED9183965620F083A85EA8E4F1EAA850/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/3D00A9EEF1ADE1B5DA6DCE5EBF30E2F3/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_get_leaderboard0_S3Object_D4AF4AC9 must be replaced
-/+ resource "aws_s3_object" "VotingAppApi_get_leaderboard0_S3Object_D4AF4AC9" {
      + acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::code-c84a50b1-20230727202411678600000003/asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.22503b883a1ab20226cfd6c66d80ebf3.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "c34a581885358eb5091cfe6ce22a8b9c" -> (known after apply)
      ~ id                     = "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.22503b883a1ab20226cfd6c66d80ebf3.zip" -> (known after apply)
      ~ key                    = "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.22503b883a1ab20226cfd6c66d80ebf3.zip" -> "asset.c8bf3988f2d3a2c1d496b96539d5a03959421f37af.b352c73d160993b87d2a5bf36db214a8.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_get_leaderboard0_Asset_7C98D66C/A3069AC20D6B67CAB34AF74CAC45A34C/archive.zip" -> "assets/VotingAppApi_get_leaderboard0_Asset_7C98D66C/3FD3ACB2AACE3E467C2584D8D8C26B74/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_post_requestChoices0_S3Object_E5911DA4 must be replaced
-/+ resource "aws_s3_object" "VotingAppApi_post_requestChoices0_S3Object_E5911DA4" {
      + acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::code-c84a50b1-20230727202411678600000003/asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.c17c81857badf45da27670f79b36cc93.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "3c75e462d454159d28eeec56b7848f79" -> (known after apply)
      ~ id                     = "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.c17c81857badf45da27670f79b36cc93.zip" -> (known after apply)
      ~ key                    = "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.c17c81857badf45da27670f79b36cc93.zip" -> "asset.c8820ba52700a98c4d6b8c373ec54bc26496a4e0ac.7e846ca4150639707d82363ccb6f2c76.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_post_requestChoices0_Asset_D5F3DEE4/B16BCA172A1FBC9F8E355C1E3F9A0C16/archive.zip" -> "assets/VotingAppApi_post_requestChoices0_Asset_D5F3DEE4/21F44DEEB05761183CE73A434C48BDD6/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_post_selectWinner0_S3Object_3DCD8E80 must be replaced
-/+ resource "aws_s3_object" "VotingAppApi_post_selectWinner0_S3Object_3DCD8E80" {
      + acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::code-c84a50b1-20230727202411678600000003/asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.dadf8a10e088212e5f582182b2b03305.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "cb94c77c809454af8936363e3396e6b5" -> (known after apply)
      ~ id                     = "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.dadf8a10e088212e5f582182b2b03305.zip" -> (known after apply)
      ~ key                    = "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.dadf8a10e088212e5f582182b2b03305.zip" -> "asset.c8d65bd11e98c1b56b54b826b80a0ffc8870c53ac6.8aa1aa495b45d77f0663ef71fe8fa598.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_post_selectWinner0_Asset_C0113166/24B53341A0964973561E369CC097756E/archive.zip" -> "assets/VotingAppApi_post_selectWinner0_Asset_C0113166/76C3558484CD4E453F59A7FF8656AF3D/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppStore_EntiresTable_Field_Handler_S3Object_271164A5 will be destroyed
  # (because aws_s3_object.VotingAppStore_EntiresTable_Field_Handler_S3Object_271164A5 is not in configuration)
  - resource "aws_s3_object" "VotingAppStore_EntiresTable_Field_Handler_S3Object_271164A5" {
      - arn                    = "arn:aws:s3:::code-c84a50b1-20230727202411678600000003/asset.c82491a2ec5b7a164e717e9480c7bd986febfef2e2.df8e33810800861beb66401181e3916c.zip" -> null
      - bucket                 = "code-c84a50b1-20230727202411678600000003" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "1f9fc1e60b36af5ba6dd12a1733f5dc5" -> null
      - force_destroy          = false -> null
      - id                     = "asset.c82491a2ec5b7a164e717e9480c7bd986febfef2e2.df8e33810800861beb66401181e3916c.zip" -> null
      - key                    = "asset.c82491a2ec5b7a164e717e9480c7bd986febfef2e2.df8e33810800861beb66401181e3916c.zip" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "assets/VotingAppStore_EntiresTable_Field_Handler_Asset_41386787/3C3D1A8849A4C603934C299C08EEB43E/archive.zip" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.VotingAppStore_EntriesTable_TableName_Handler_S3Object_6560E89C will be created
  + resource "aws_s3_object" "VotingAppStore_EntriesTable_TableName_Handler_S3Object_6560E89C" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "code-c84a50b1-20230727202411678600000003"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c80747e13deed42678216aea62b0d56baafb6fa1f9.5f29b59afcc466b2ad20f5f7e3a957a3.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/VotingAppStore_EntriesTable_TableName_Handler_Asset_ECAFAA8D/843466567A2FF5D6075F29AF2DC86FFA/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 11 to add, 8 to change, 11 to destroy.

```

</details>
